In [1]:
import pandas as pd

In [52]:
d = [["$229.2", 2017, 123000, "$1100", "Cupertino, US"],
    ["$211.9", 2017, 320671, "$284", "Suwon, South Korea"],
    ["$177.8", 2017, 566000, "$985", "Seattle, US"],
    ["$154.7", 2017, 130000, "$66", "New Tapei, Tapei"],
    ["$110.8", 2017,80110, "$834","Mountain View, USA"]]

comps = ['apples', 'samsung', 'amazon', 'foxconn', 'alphabet']
cols = ['revenue', 'fy', 'employees', 'mcap', 'location']

In [53]:
df = pd.DataFrame(d, index = comps, columns = cols)

In [10]:
df

         revenue    fy employees   mcap            location
apples    $229.2  2017    123000  $1100       Cupertino, US
samsung   $211.9  2017    320671   $284  Suwon, South Korea
amazon    $177.8  2017    566000   $985         Seattle, US
foxconn   $154.7  2017    130000    $66    New Tapei, Tapei
alphabet  $110.8  2017     80110   $834  Mountain View, USA

In [11]:
del df['mcap']

In [12]:
df

         revenue    fy employees            location
apples    $229.2  2017    123000       Cupertino, US
samsung   $211.9  2017    320671  Suwon, South Korea
amazon    $177.8  2017    566000         Seattle, US
foxconn   $154.7  2017    130000    New Tapei, Tapei
alphabet  $110.8  2017     80110  Mountain View, USA

In [15]:
df.drop('fy',axis = 1, inplace = True)

In [16]:
df

         revenue employees            location
apples    $229.2    123000       Cupertino, US
samsung   $211.9    320671  Suwon, South Korea
amazon    $177.8    566000         Seattle, US
foxconn   $154.7    130000    New Tapei, Tapei
alphabet  $110.8     80110  Mountain View, USA

In [17]:
# 3 ways to retrieve a specific value 
df['revenue']['amazon']

'$177.8'

In [22]:
df.loc['amazon','revenue']

'$177.8'

In [23]:
df.iloc[2,0]

'$177.8'

In [25]:
df.head(3)

        revenue employees            location
apples   $229.2    123000       Cupertino, US
samsung  $211.9    320671  Suwon, South Korea
amazon   $177.8    566000         Seattle, US

In [26]:
df[:3]

        revenue employees            location
apples   $229.2    123000       Cupertino, US
samsung  $211.9    320671  Suwon, South Korea
amazon   $177.8    566000         Seattle, US

In [27]:
df['apples':'amazon']

        revenue employees            location
apples   $229.2    123000       Cupertino, US
samsung  $211.9    320671  Suwon, South Korea
amazon   $177.8    566000         Seattle, US

In [35]:
df['apples':'amazon'][['revenue', 'location']]

        revenue            location
apples   $229.2       Cupertino, US
samsung  $211.9  Suwon, South Korea
amazon   $177.8         Seattle, US

In [39]:
df.index

Index(['apples', 'samsung', 'amazon', 'foxconn', 'alphabet'], dtype='object')

In [60]:
##Add a Column ( Align by Labels, fill in missing with NaN)
df['state'] = pd.Series({'apples':'CA','amazon':'WA'})

In [54]:
df['employees'] / 10000

apples      12.3000
samsung     32.0671
amazon      56.6000
foxconn     13.0000
alphabet     8.0110
Name: employees, dtype: float64

In [57]:
df[df['employees'] < 100000]

         revenue    fy  employees  mcap            location
alphabet  $110.8  2017      80110  $834  Mountain View, USA

*** Handling NaN / Missing Data / NA ***

In [58]:
df

         revenue    fy  employees   mcap            location
apples    $229.2  2017     123000  $1100       Cupertino, US
samsung   $211.9  2017     320671   $284  Suwon, South Korea
amazon    $177.8  2017     566000   $985         Seattle, US
foxconn   $154.7  2017     130000    $66    New Tapei, Tapei
alphabet  $110.8  2017      80110   $834  Mountain View, USA

In [61]:
df['state'] = pd.Series({'apples':'CA','amazon':'WA'})

In [63]:
#only find rows where state is missing
df[df['state'].isnull()]

         revenue    fy  employees  mcap            location state
samsung   $211.9  2017     320671  $284  Suwon, South Korea   NaN
foxconn   $154.7  2017     130000   $66    New Tapei, Tapei   NaN
alphabet  $110.8  2017      80110  $834  Mountain View, USA   NaN

In [65]:
#fill in missing with ' ''
df['state'] = df['state'].fillna('')

In [66]:
df

         revenue    fy  employees   mcap            location state
apples    $229.2  2017     123000  $1100       Cupertino, US    CA
samsung   $211.9  2017     320671   $284  Suwon, South Korea
amazon    $177.8  2017     566000   $985         Seattle, US    WA
foxconn   $154.7  2017     130000    $66    New Tapei, Tapei
alphabet  $110.8  2017      80110   $834  Mountain View, USA

In [68]:
#string transformation 
df['location'] = df['location'].str.upper()

In [69]:
df

         revenue    fy  employees   mcap            location state
apples    $229.2  2017     123000  $1100       CUPERTINO, US    CA
samsung   $211.9  2017     320671   $284  SUWON, SOUTH KOREA
amazon    $177.8  2017     566000   $985         SEATTLE, US    WA
foxconn   $154.7  2017     130000    $66    NEW TAPEI, TAPEI
alphabet  $110.8  2017      80110   $834  MOUNTAIN VIEW, USA

In [72]:
df['country'] = df['location'].str.split(',').str[1]

In [73]:
df

,revenue,fy,employees,mcap,location,state,country
apples,$229.2,2017,123000,$1100,"CUPERTINO, US",CA,US
samsung,$211.9,2017,320671,$284,"SUWON, SOUTH KOREA",,SOUTH KOREA
amazon,$177.8,2017,566000,$985,"SEATTLE, US",WA,US
foxconn,$154.7,2017,130000,$66,"NEW TAPEI, TAPEI",,TAPEI
alphabet,$110.8,2017,80110,$834,"MOUNTAIN VIEW, USA",,USA

In [76]:
df.reindex(index=[*(list(df.index)),'microsoft'])

,revenue,fy,employees,mcap,location,state,country
apples,$229.2,2017.0,123000.0,$1100,"CUPERTINO, US",CA,US
samsung,$211.9,2017.0,320671.0,$284,"SUWON, SOUTH KOREA",,SOUTH KOREA
amazon,$177.8,2017.0,566000.0,$985,"SEATTLE, US",WA,US
foxconn,$154.7,2017.0,130000.0,$66,"NEW TAPEI, TAPEI",,TAPEI
alphabet,$110.8,2017.0,80110.0,$834,"MOUNTAIN VIEW, USA",,USA
microsoft,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
##working with map, apply, applyTransform